{
    "format": "layers-model",
    "generatedBy": "keras v2.6.0",
    "convertedBy": "TensorFlow.js Converter v3.11.0",
    "modelTopology":
    {
        "keras_version": "2.6.0",
        "backend": "tensorflow",
        "model_config":
        {
            "class_name": "Functional",
            "config":
            {
                "name": "Xception",
                "layers":
                [
                    {
                        "class_name": "InputLayer",
                        "config":
                        {
                            "batch_input_shape":
                            [
                                null,
                                64,
                                64,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes":
                        []
                    },
                    {
                        "class_name": "Conv2D",
                        "config":
                        {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size":
                            [
                                5,
                                5
                            ],
                            "strides":
                            [
                                2,
                                2
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 6
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "conv2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 11
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_1",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config":
                        {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                1,
                                1
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "conv2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_1",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 20
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_2",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 25
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_3",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add_1",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add_1",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_3",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "add",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 31
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_4",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 36
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_5",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add_2",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add_2",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_5",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "add_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_6",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 42
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_6",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 47
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_7",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add_3",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add_3",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_7",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "add_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_8",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 53
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_8",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_9",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 58
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_9",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add_4",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add_4",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_9",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "add_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_10",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 1024,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 64
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_10",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config":
                        {
                            "name": "separable_conv2d_11",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 1024,
                            "kernel_size":
                            [
                                3,
                                3
                            ],
                            "strides":
                            [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {},
                                "shared_object_id": 69
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": null,
                            "pointwise_initializer": null,
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv2d_11",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_10",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config":
                        {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size":
                            [
                                3,
                                3
                            ],
                            "padding": "same",
                            "strides":
                            [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "separable_conv2d_11",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config":
                        {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 1024,
                            "kernel_size":
                            [
                                1,
                                1
                            ],
                            "strides":
                            [
                                2,
                                2
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate":
                            [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config":
                        {
                            "name": "add_5",
                            "trainable": true,
                            "dtype": "float32"
                        },
                        "name": "add_5",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "max_pooling2d",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "GlobalMaxPooling2D",
                        "config":
                        {
                            "name": "global_max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last",
                            "keepdims": false
                        },
                        "name": "global_max_pooling2d",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "add_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config":
                        {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "selu",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "global_max_pooling2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config":
                        {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": null,
                            "bias_initializer":
                            {
                                "class_name": "Zeros",
                                "config":
                                {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_1",
                        "inbound_nodes":
                        [
                            [
                                [
                                    "dense",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers":
                [
